# GetClLS

## Description
Deprecated - will generate error. Use GetClLSN instead.&lt;BR&gt;
Returns the line style of the specified class.&lt;BR&gt;

```pascal
FUNCTION GetClLS(className : STRING) : INTEGER;
```

```python

def vs.GetClLS(className):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## Remarks
Deprecated - will generate error. Use GetClLSN instead. Original description was: Returns the line style of a specified class.

## Examples
```pascal
pbLineSty:= GetClLS('Property Bounds');
```

## See Also
VS Functions:
GetClLSN

## Version
```diff
- GetClLS is obsolete as of Vectorworks 2013
```

Availability: from VectorWorks8.0
## Category
* Classes